In [1]:
import json 


with open('data.json') as f:
    data = json.load(f)

In [2]:
import pandas as pd
pd.options.mode.copy_on_write = True

nodes_df = pd.DataFrame(data['nodes'])
edges_df = pd.DataFrame(data['links'])

## Clean Nodes

In [3]:
print(len(nodes_df))
# Drop duplicates based on the name column
new_nodes_df = nodes_df.drop_duplicates(subset='name')
print(len(new_nodes_df))
new_nodes_df.head()

860
859

                     name  group nodesize
0  Nageswara Rao Akkineni  actor        3
1         Jagdeep Jaffrey  actor        1
2     Meenakshi Shirodkar  actor        1
3        Shilpa Shirodkar  actor        2
4       Namrata Shirodkar  actor        3

In [4]:
# make all names lowercase and strip whitespace
new_nodes_df['name'] = new_nodes_df['name'].str.strip()
new_nodes_df.head()

                     name  group nodesize
0  Nageswara Rao Akkineni  actor        3
1         Jagdeep Jaffrey  actor        1
2     Meenakshi Shirodkar  actor        1
3        Shilpa Shirodkar  actor        2
4       Namrata Shirodkar  actor        3

## Clean Edges

In [5]:
print(len(edges_df))
# Drop duplicates based on the source and target columns
new_edges_df = edges_df.drop_duplicates(subset=['source', 'target'])
print(len(new_edges_df))
new_edges_df.head()

940
922

                  source               target      relation
0   Balwantrao Abhisheki   Jitendra Abhisheki  parent-child
1   Balwantrao Abhisheki  Dinanath Mangeshkar       sibling
2     Jitendra Abhisheki    Shounak Abhisheki  parent-child
3           B. K. Adarsh         Taran Adarsh  parent-child
4  Alvira Khan Agnihotri          Salman Khan       sibling

In [6]:
# make all names lowercase and strip whitespace
new_edges_df['source'] = new_edges_df['source'].str.strip()
new_edges_df['target'] = new_edges_df['target'].str.strip()
new_edges_df.head()

                  source               target      relation
0   Balwantrao Abhisheki   Jitendra Abhisheki  parent-child
1   Balwantrao Abhisheki  Dinanath Mangeshkar       sibling
2     Jitendra Abhisheki    Shounak Abhisheki  parent-child
3           B. K. Adarsh         Taran Adarsh  parent-child
4  Alvira Khan Agnihotri          Salman Khan       sibling

## Save Data

In [7]:
#save the cleaned data in its original format
data['nodes'] = new_nodes_df.to_dict(orient='records')
data['links'] = new_edges_df.to_dict(orient='records')
# save as json
with open('cleaned_data.json', 'w') as f:
    json.dump(data, f, indent=4)